{
    "ingredients": [{
            "name": "Jalapeno",
            "img": "https://8e9d5b8b8dcb9208ef3f-01db2a53ae0368d03387780ee86ead55.ssl.cf2.rackcdn.com/0000000046930_CF_hyvee_default_large.png",
            "taste": "Jalapeno's vary widely in spiciness, but can be considered <b>medium spiciness</b>. Try some before adding them to the sauce",
            "use": "Best used during the <b>pan frying stage</b>. Blending it raw will not make a good hot sauce",
            "misc": "<b>Scoville Scale:</b> 3,500 - 8,000"
        },
        {
            "name": "Cayenne",
            "img": "https://i.imgur.com/4VJxyjd.png",
            "taste": "Typically considered a <b>medium-hot</b> chili, as it is 12x hotter than jalapenos. Bit of zing to its flavor, and has health benefits.",
            "use": "Best used during the <b>pan frying stage</b>. Blending it raw will not make a good hot sauce",
            "misc": "<b>Scoville Scale:</b>  30,000 - 50,000"
        },
        {
            "name": "Ghost",
            "img": "https://i.imgur.com/mHTVt82.png",
            "taste": "<b>400x hotter</b> than Tabasco sauce, Ghost Pepper Hot sauce packs a punch. It was the hottest chilli pepper before the invention of the Carolina Reaper in 2013.",
            "use": "Best used during the <b>pan frying stage</b>. Blending it raw will not make a good hot sauce",
            "misc": "<b>Scoville Scale:</b> 1,000,000 - 1,200,000"
        },
        {
            "name": "Water",
            "img": "https://i.pinimg.com/originals/e8/3c/a1/e83ca1e57aaa9fdecbda73ac78e02ce1.png",
            "taste": "It is water.",
            "use": "Use it during the <b>pan frying stage</b> to avoid burning the peppers. Use it during <b>blending</b> if you want a <b>milder</b> hot sauce."
        },
        {
            "name": "Vinegar",
            "img": "https://themealdb.com/images/ingredients/white%20vinegar.png",
            "taste": "Adds a <b>tangy, sour, lip-smacking flavor</b>. Core ingredient for almost all hot sauce.",
            "misc": "<b>Benefits:</b> Adds <b>acidity</b> to sauce, allowing it to have a much longer shelf life. It keeps the sauce from oxidizing.",
            "use": "Must use ingredient during either <b>pan cooking</b> and <b>blending</b> process."
        },
        {
            "name": "Onion",
            "img": "https://www.pngarts.com/files/3/Onion-Transparent-Background-PNG.png",
            "taste": "Taste depends on the type of onion, so pick up ones at the store to match your preferences. Can be hot, bitter, sweet, acidic, so choose one you like or experiment!",
            "use": "Use <b>chopped onions</b> during the <b>pan stage</b> to bring out the flavor of the onion and to incorporate it into the peppers.",
            "misc": "<b>Advice:</b> Doesn't matter what kind of onion you use, but white and yellow onions will preserve the color of the hot sauce, while red onions might change it."
        },
        {
            "name": "Sugar",
            "img": "https://pngimg.com/uploads/sugar/sugar_PNG98791.png",
            "taste": "Sweet",
            "use": "Use it to give your hot sauce a <b>sweeter</b> taste. It can also give it a <b>thicker</b> texture.",
            "misc": "<b>Advice:</b> Be aware that sugar will add calories to your sauce, but hot sauce calorie values are normally ignorable."
        }, {
            "name": "Salt",
            "img": "https://pngimg.com/uploads/salt/salt_PNG7.png",
            "taste": "<b>Essential</b> flavor in food and hot sauce. Infentifies aromas, balances flavors, and preserves food.",
            "use": "Use anytime. You can never go wrong with salt, unless you add too much of course.",
            "misc": "<b>Advice:</b> Be wary of the sodium content of your hot sauce if you add too much."
        },
        {
            "name": "Apple Cider",
            "img": "https://www.jing.fm/clipimg/full/125-1255635_apple-cider-png-hot-apple-cider-png.png",
            "taste": "little sweet with much <b>stronger smell</b> and <b>distinct flavor</b>",
            "use": "Use it during either the <b>pan or blending stage</b>. Add to bottle if you want pure cider in it.",
            "misc": "<b>Advice:</b> Can subsitute for vinegar, but it all comes down to taste. Try both and choose one to use, or use a little of each."
        },
        {
            "name": "Garlic",
            "img": "https://pngimg.com/uploads/garlic/garlic_PNG12796.png",
            "taste": "Nutty, mild taste. Essential ingredient in many foods, and can <b>boost flavors</b> in hot sauce",
            "use": "Cook it during <b>pan stage</b> to mellow out the flavors.",
            "misc": "<b>Advice:</b> Be sure to not cook it for too long as it can burn quickly if cut small."
        }
    ]
}